In [ ]:
import numpy as np
import pandas as pd

creating a dataframe

In [ ]:
import numpy as np
import pandas as pd

data = {
    'Name':['sumit','rahul','peter','linda'],
    'age':[28,34,29,42],
    'city':['new york','paris','berlin','london'],
    'salary':[65000,70000,62000,85000]
}

df = pd.DataFrame(data)

    Name  age      city  salary
0  sumit   28  new york   65000
1  rahul   34     paris   70000
2  peter   29    berlin   62000
3  linda   42    london   85000

In [8]:
data_list = [
    ['john','28','new york',65000],
    ['anna',34,'paris',70000],
    ['peter',29,'berlin',620000],
    ['linda',42,'london','850000']
]

df2 = pd.DataFrame(data_list);
print(df2)
print("adding columns")
columns = ["name","age","city","salary"]
df2 = pd.DataFrame(data_list,columns=columns);
print(df2)

       0   1         2       3
0   john  28  new york   65000
1   anna  34     paris   70000
2  peter  29    berlin  620000
3  linda  42    london  850000
adding columns
    name age      city  salary
0   john  28  new york   65000
1   anna  34     paris   70000
2  peter  29    berlin  620000
3  linda  42    london  850000

selection and indexing of columns

In [12]:
print(df2['name']);
print(df2['city']);
print(df2['salary'])

0     john
1     anna
2    peter
3    linda
Name: name, dtype: object
0    new york
1       paris
2      berlin
3      london
Name: city, dtype: object
0     65000
1     70000
2    620000
3    850000
Name: salary, dtype: object

In [13]:
print(df2[["name","city"]])

    name      city
0   john  new york
1   anna     paris
2  peter    berlin
3  linda    london

creating a markdown